socialNetwork/jaeger_traces/limit_socnetapp_text-service/traces_0.9.log
Running 30s test @ http://node0.krisub-247336.ldos-ut-pg0.wisc.cloudlab.us:8080/wrk2-api/post/compose
  8 threads and 1000 connections

  Thread calibration: mean lat.: 4.681ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 4.660ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 5.077ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 4.582ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 4.649ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 4.726ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 4.616ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 4.668ms, rate sampling interval: 10ms
Logging function completed.

-----------------------------------------------------------------------
Test Results @ http://node0.krisub-247336.ldos-ut-pg0.wisc.cloudlab.us:8080/wrk2-api/post/compose 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     4.63ms  665.76us   6.61ms   76.63%
    Req/Sec    25.65     51.08   200.00     77.39%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    4.49ms
 75.000%    4.93ms
 90.000%    5.46ms
 99.000%    6.61ms
 99.900%    9.07ms
 99.990%   13.21ms
 99.999%   13.21ms
100.000%   13.21ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       3.433     0.000000            1         1.00
       3.967     0.100000          394         1.11
       4.123     0.200000          784         1.25
       4.243     0.300000         1170         1.43
       4.359     0.400000         1561         1.67
       4.491     0.500000         1952         2.00
       4.563     0.550000         2152         2.22
       4.647     0.600000         2340         2.50
       4.735     0.650000         2540         2.86
       4.827     0.700000         2733         3.33
       4.935     0.750000         2923         4.00
       5.011     0.775000         3021         4.44
       5.087     0.800000         3120         5.00
       5.159     0.825000         3215         5.71
       5.247     0.850000         3313         6.67
       5.343     0.875000         3410         8.00
       5.391     0.887500         3458         8.89
       5.459     0.900000         3508        10.00
       5.531     0.912500         3556        11.43
       5.603     0.925000         3605        13.33
       5.687     0.937500         3653        16.00
       5.727     0.943750         3675        17.78
       5.787     0.950000         3701        20.00
       5.867     0.956250         3724        22.86
       5.931     0.962500         3748        26.67
       6.015     0.968750         3773        32.00
       6.095     0.971875         3786        35.56
       6.119     0.975000         3797        40.00
       6.199     0.978125         3809        45.71
       6.235     0.981250         3821        53.33
       6.323     0.984375         3836        64.00
       6.351     0.985938         3840        71.11
       6.443     0.987500         3846        80.00
       6.547     0.989062         3852        91.43
       6.651     0.990625         3858       106.67
       6.707     0.992188         3864       128.00
       6.795     0.992969         3867       142.22
       6.847     0.993750         3870       160.00
       6.999     0.994531         3873       182.86
       7.259     0.995313         3876       213.33
       7.347     0.996094         3879       256.00
       7.655     0.996484         3881       284.44
       7.739     0.996875         3882       320.00
       8.179     0.997266         3884       365.71
       8.383     0.997656         3885       426.67
       8.711     0.998047         3887       512.00
       8.783     0.998242         3888       568.89
       8.783     0.998437         3888       640.00
       8.967     0.998633         3889       731.43
       9.071     0.998828         3890       853.33
      11.015     0.999023         3891      1024.00
      11.015     0.999121         3891      1137.78
      11.015     0.999219         3891      1280.00
      11.143     0.999316         3892      1462.86
      11.143     0.999414         3892      1706.67
      12.231     0.999512         3893      2048.00
      12.231     0.999561         3893      2275.56
      12.231     0.999609         3893      2560.00
      12.231     0.999658         3893      2925.71
      12.231     0.999707         3893      3413.33
      13.207     0.999756         3894      4096.00
      13.207     1.000000         3894          inf
#[Mean    =        4.630, StdDeviation   =        0.666]
#[Max     =       13.200, Total count    =         3894]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  5826 requests in 30.04s, 1.19MB read
  Socket errors: connect 0, read 0, write 0, timeout 9511
Requests/sec:    193.92  
Transfer/sec:     40.72KB