socialNetwork/jaeger_traces/limit_socnetapp_text-service/traces_socnetapp_text-service_0.9.log
Running 30s test @ http://node0.krisub-247336.ldos-ut-pg0.wisc.cloudlab.us:8080/wrk2-api/post/compose
  8 threads and 1000 connections

  Thread calibration: mean lat.: 4.783ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 4.929ms, rate sampling interval: 12ms
  Thread calibration: mean lat.: 4.826ms, rate sampling interval: 12ms
  Thread calibration: mean lat.: 5.069ms, rate sampling interval: 13ms
  Thread calibration: mean lat.: 4.773ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 4.840ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 4.832ms, rate sampling interval: 11ms
  Thread calibration: mean lat.: 4.793ms, rate sampling interval: 11ms
Logging function completed.

-----------------------------------------------------------------------
Test Results @ http://node0.krisub-247336.ldos-ut-pg0.wisc.cloudlab.us:8080/wrk2-api/post/compose 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     4.50ms  605.27us   6.38ms   75.08%
    Req/Sec    25.45     48.64   200.00     75.68%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    4.41ms
 75.000%    4.80ms
 90.000%    5.24ms
 99.000%    6.38ms
 99.900%    8.27ms
 99.990%   11.37ms
 99.999%   11.37ms
100.000%   11.37ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       3.279     0.000000            1         1.00
       3.851     0.100000          393         1.11
       4.013     0.200000          781         1.25
       4.151     0.300000         1189         1.43
       4.271     0.400000         1563         1.67
       4.411     0.500000         1956         2.00
       4.475     0.550000         2151         2.22
       4.547     0.600000         2342         2.50
       4.623     0.650000         2545         2.86
       4.699     0.700000         2731         3.33
       4.799     0.750000         2931         4.00
       4.859     0.775000         3025         4.44
       4.923     0.800000         3123         5.00
       4.975     0.825000         3219         5.71
       5.039     0.850000         3316         6.67
       5.123     0.875000         3413         8.00
       5.171     0.887500         3462         8.89
       5.239     0.900000         3510        10.00
       5.299     0.912500         3563        11.43
       5.367     0.925000         3611        13.33
       5.451     0.937500         3661        16.00
       5.499     0.943750         3683        17.78
       5.551     0.950000         3705        20.00
       5.599     0.956250         3730        22.86
       5.667     0.962500         3754        26.67
       5.795     0.968750         3779        32.00
       5.863     0.971875         3792        35.56
       5.903     0.975000         3803        40.00
       5.959     0.978125         3816        45.71
       6.027     0.981250         3827        53.33
       6.111     0.984375         3840        64.00
       6.187     0.985938         3846        71.11
       6.239     0.987500         3852        80.00
       6.343     0.989062         3858        91.43
       6.423     0.990625         3864       106.67
       6.527     0.992188         3870       128.00
       6.555     0.992969         3873       142.22
       6.631     0.993750         3876       160.00
       6.711     0.994531         3880       182.86
       6.715     0.995313         3882       213.33
       6.843     0.996094         3885       256.00
       6.935     0.996484         3887       284.44
       6.963     0.996875         3888       320.00
       6.979     0.997266         3890       365.71
       6.987     0.997656         3891       426.67
       7.343     0.998047         3893       512.00
       7.799     0.998242         3894       568.89
       7.799     0.998437         3894       640.00
       7.999     0.998633         3895       731.43
       8.271     0.998828         3896       853.33
       8.591     0.999023         3897      1024.00
       8.591     0.999121         3897      1137.78
       8.591     0.999219         3897      1280.00
      10.031     0.999316         3898      1462.86
      10.031     0.999414         3898      1706.67
      11.087     0.999512         3899      2048.00
      11.087     0.999561         3899      2275.56
      11.087     0.999609         3899      2560.00
      11.087     0.999658         3899      2925.71
      11.087     0.999707         3899      3413.33
      11.367     0.999756         3900      4096.00
      11.367     1.000000         3900          inf
#[Mean    =        4.496, StdDeviation   =        0.605]
#[Max     =       11.360, Total count    =         3900]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  5785 requests in 30.12s, 1.19MB read
  Socket errors: connect 0, read 0, write 0, timeout 9498
  Non-2xx or 3xx responses: 5
Requests/sec:    192.08  
Transfer/sec:     40.34KB